docs: improve topology diagram
